app/Models/AuthModel.php

SELECT *
FROM `user`
WHERE `username` = 'Mauludin'
AND `password` = '123'
---
    public function login($username, $password)
    {
        return $this->db->table('user')->where([
            'username' => $username,
            'password' => $password,
        ])->get()->getRowArray();